; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	instrument7 - instrument
	infrared1 - mode
	infrared3 - mode
	infrared0 - mode
	infrared4 - mode
	image2 - mode
	Star7 - direction
	GroundStation6 - direction
	Star8 - direction
	GroundStation1 - direction
	GroundStation3 - direction
	GroundStation4 - direction
	Star2 - direction
	GroundStation9 - direction
	GroundStation0 - direction
	Star5 - direction
	Phenomenon10 - direction
	Planet11 - direction
	Star12 - direction
	Star13 - direction
	Phenomenon14 - direction
	Star15 - direction
)
(:init
	(supports instrument0 infrared4)
	(calibration_target instrument0 Star8)
	(supports instrument1 infrared3)
	(calibration_target instrument1 Star7)
	(calibration_target instrument1 Star8)
	(calibration_target instrument1 GroundStation6)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon14)
	(supports instrument2 infrared3)
	(supports instrument2 image2)
	(calibration_target instrument2 GroundStation9)
	(supports instrument3 infrared1)
	(calibration_target instrument3 GroundStation6)
	(calibration_target instrument3 Star2)
	(calibration_target instrument3 Star5)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star7)
	(supports instrument4 infrared1)
	(calibration_target instrument4 GroundStation1)
	(calibration_target instrument4 GroundStation3)
	(calibration_target instrument4 Star8)
	(supports instrument5 infrared4)
	(supports instrument5 image2)
	(calibration_target instrument5 GroundStation3)
	(calibration_target instrument5 GroundStation9)
	(calibration_target instrument5 GroundStation0)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation4)
	(supports instrument6 image2)
	(calibration_target instrument6 GroundStation9)
	(calibration_target instrument6 Star2)
	(calibration_target instrument6 GroundStation4)
	(supports instrument7 infrared1)
	(supports instrument7 infrared3)
	(supports instrument7 infrared0)
	(calibration_target instrument7 Star5)
	(calibration_target instrument7 GroundStation0)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation0)
)
(:goal (and
	(pointing satellite1 GroundStation3)
	(pointing satellite2 GroundStation6)
	(pointing satellite3 Star5)
	(have_image Phenomenon10 infrared1)
	(have_image Planet11 infrared4)
	(have_image Star12 infrared3)
	(have_image Star13 infrared4)
	(have_image Phenomenon14 image2)
	(have_image Star15 infrared0)
))

)

; plan
1. (switch_on instrument7 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument7)
   goals met: 0 of 9
2. (calibrate satellite3 instrument7 groundstation0)
   added: (calibrated instrument7)
   goals met: 0 of 9
3. (turn_to satellite3 star15 groundstation0)
   deleted: (pointing satellite3 groundstation0)
   added: (pointing satellite3 star15)
   goals met: 0 of 9
4. (take_image satellite3 star15 instrument7 infrared0)
   added: (have_image star15 infrared0)
   goals met: 1 of 9
5. (turn_to satellite3 star12 star15)
   deleted: (pointing satellite3 star15)
   added: (pointing satellite3 star12)
   goals met: 1 of 9
6. (take_image satellite3 star12 instrument7 infrared3)
   added: (have_image star12 infrared3)
   goals met: 2 of 9
7. (turn_to satellite3 phenomenon10 star12)
   deleted: (pointing satellite3 star12)
   added: (pointing satellite3 phenomenon10)
   goals met: 2 of 9
8. (turn_to satellite2 groundstation0 groundstation4)
   deleted: (pointing satellite2 groundstation4)
   added: (pointing satellite2 groundstation0)
   goals met: 2 of 9
9. (turn_to satellite1 groundstation3 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 groundstation3)
   goals met: 3 of 9
10. (take_image satellite3 phenomenon10 instrument7 infrared1)
   added: (have_image phenomenon10 infrared1)
   goals met: 4 of 9
11. (switch_on instrument5 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument5)
   goals met: 4 of 9
12. (calibrate satellite2 instrument5 groundstation0)
   added: (calibrated instrument5)
   goals met: 4 of 9
13. (turn_to satellite2 phenomenon14 groundstation0)
   deleted: (pointing satellite2 groundstation0)
   added: (pointing satellite2 phenomenon14)
   goals met: 4 of 9
14. (take_image satellite2 phenomenon14 instrument5 image2)
   added: (have_image phenomenon14 image2)
   goals met: 5 of 9
15. (turn_to satellite2 planet11 phenomenon14)
   deleted: (pointing satellite2 phenomenon14)
   added: (pointing satellite2 planet11)
   goals met: 5 of 9
16. (take_image satellite2 planet11 instrument5 infrared4)
   added: (have_image planet11 infrared4)
   goals met: 6 of 9
17. (turn_to satellite2 star13 planet11)
   deleted: (pointing satellite2 planet11)
   added: (pointing satellite2 star13)
   goals met: 6 of 9
18. (take_image satellite2 star13 instrument5 infrared4)
   added: (have_image star13 infrared4)
   goals met: 7 of 9
19. (turn_to satellite2 groundstation6 star13)
   deleted: (pointing satellite2 star13)
   added: (pointing satellite2 groundstation6)
   goals met: 8 of 9
20. (turn_to satellite3 star5 phenomenon10)
   deleted: (pointing satellite3 phenomenon10)
   added: (pointing satellite3 star5)
   goals met: 9 of 9
